<template>
  <div class="terms-of-service container">
    <h1>Условия использования</h1>
    <p>
      Пожалуйста, внимательно ознакомьтесь с настоящими Условиями использования, прежде чем
      использовать наш сайт или совершать покупки в нашем интернет-магазине.
    </p>

    <section class="terms-section">
      <h2>1. Общие положения</h2>
      <p>
        Эти Условия использования регулируют доступ и использование веб-сайта (далее — «Сайт»). Используя этот Сайт, вы соглашаетесь соблюдать все
        условия, изложенные ниже.
      </p>
    </section>

    <section class="terms-section">
      <h2>2. Регистрация и учетная запись</h2>
      <p>
        Для использования некоторых функций нашего Сайта, таких как покупка товаров, вам необходимо
        зарегистрировать учетную запись. Вы обязуетесь предоставить точную, актуальную информацию и
        поддерживать ее в актуальном состоянии.
      </p>
    </section>

    <section class="terms-section">
      <h2>3. Права и обязанности пользователей</h2>
      <p>Пользователи обязаны:</p> <!-- Модификация: убираем <ul> из <p> -->
      <ul>
        <li>Предоставлять достоверную информацию при регистрации.</li>
        <li>Использовать Сайт только в законных целях.</li>
        <li>Не нарушать права других пользователей.</li>
      </ul>
    </section>

    <section class="terms-section">
      <h2>4. Товары и услуги</h2>
      <p>
        Мы делаем все возможное для обеспечения точности информации о товарах, однако не можем
        гарантировать отсутствие ошибок. Цены могут изменяться, и мы оставляем за собой право
        изменять условия без предварительного уведомления.
      </p>
    </section>

    <section class="terms-section">
      <h2>5. Оплата и доставка</h2>
      <p>
        Оплата товаров может быть произведена различными способами, указанными на нашем Сайте. Доставка
        осуществляется по указанным нами условиям и срокам.
      </p>
    </section>

    <section class="terms-section">
      <h2>6. Ответственность</h2>
      <p>
        Мы не несем ответственности за убытки, возникшие в результате использования или невозможности
        использования Сайта, а также за содержание сторонних сайтов, ссылки на которые могут быть
        размещены на нашем Сайте.
      </p>
    </section>

    <section class="terms-section">
      <h2>7. Заключительные положения</h2>
      <p>
        Мы оставляем за собой право изменять эти Условия использования в любое время. Все изменения
        будут опубликованы на этой странице.
      </p>
    </section>
  </div>
</template>

<script>
export default {
  name: 'TermsOfService'
};
</script>

<style scoped>

h1 {
  text-align: center;
  color: #333;
}

h2 {
  margin-top: 20px;
  color: #000000;
}

ul {
  list-style-type: disc;
  padding-left: 20px;
}

.terms-section {
  margin-bottom: 20px;
}
</style>
